<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Subcategories;
use App\User;
use App\Categories;

class SubcategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $subcategories = [
            // Category 1 - બારસાખ
            [
                'cat_id' => 1,
                'name' => 'રજવાડી બારસાખ',
            ],
            [
                'cat_id' => 1,
                'name' => '4 X 3 બારસાખ',
            ],
            [
                'cat_id' => 1,
                'name' => '5 X 3 પ્લેન બારસાખ',
            ],
            
            // Category 12 - ટાંકી
            [
                'cat_id' => 2,
                'name' => '૧|| * ૨ - ૨ ફુટ ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => '૧|| * ૨ - 3 ફુટ ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => '૧| * ૧| ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => '૨૦૦ લિટર ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => '૪૦૦ લિટર ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => '૬૦૦ લિટર ટાંકી',
            ],
            [
                'cat_id' => 2,
                'name' => 'મિજાગરવાળી નાની અવાડી',
            ],
            [
                'cat_id' => 2,
                'name' => 'મોટી અવાડી',
            ],
            [
                'cat_id' => 2,
                'name' => '૧|| * ૨ પત્થર',
            ],
            
            // Category 13 - બારી - બ્રાઈટ
            [
                'cat_id' => 3,
                'name' => '૧|| * ૨ - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '૨|| * ૨ - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '૨|| * 3  - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '3 * 3 - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '3|| * ૪ - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '૪ * 3 - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '3 * ૨ - બ્રાઈટ',
            ],
            [
                'cat_id' => 3,
                'name' => '૪ * 3 - બ્રાઈટ',
            ],
            
            // Category 14 - સુમો - બારી
            [
                'cat_id' => 4,
                'name' => '૧|| * ૨ સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૧|| * ૧|| સાદી',
            ],
            [
                'cat_id' => 4,
                'name' => '૨|| * ૨ સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૨|| * 3 સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '3|| * 3 સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '3 * 3 સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૪ * 3 સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '3 * ૨ સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૪ * 3 ઉભી સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૧|| * ૨ સુમો',
            ],
            [
                'cat_id' => 4,
                'name' => '૧ || * ૧ | - સુમો',
            ],
            
            // Category 15 - સનેડો - બારી
            [
                'cat_id' => 5,
                'name' => '૧|| * ૨ - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '૨ || * ૨ - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '૨ || * 3 - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '3 * 3 - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '3 || * 3 - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '3 || * ૪ - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '૪ * 3 - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '3 * ૨ - સનેડો',
            ],
            [
                'cat_id' => 5,
                'name' => '૪ * 3 -  ઉભી સનેડો',
            ],
            
            // Category 6 - ૧| ફુટ ના પત્થર
            [
                'cat_id' => 6,
                'name' => '૨ || * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '3 * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '3 || * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '૪ * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '૪ || * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '૫ * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '૫ || * ૧ | - પત્થર',
            ],
            [
                'cat_id' => 6,
                'name' => '૬ * ૧ | - પત્થર',
            ],
            
            // Category 7 - ૧|| ફુટ ના પત્થર
            [
                'cat_id' => 7,
                'name' => '૨ || * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '3 * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '3 || * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '૪ * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '૪ || * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '૫ * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '૫ || * ૧ || - પત્થર',
            ],
            [
                'cat_id' => 7,
                'name' => '૬ * ૧ || - પત્થર',
            ],
            
            // Category 8 - ૨ ફુટ ના પત્થર
            [
                'cat_id' => 8,
                'name' => '૨ * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૨ || * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '3 * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૩ || * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૪ * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૪ || * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૫ * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૫ || * ૨ - પત્થર',
            ],
            [
                'cat_id' => 8,
                'name' => '૬ * ૨ - પત્થર',
            ],
            
            // Category 9 - બેલાખા - બાકડા
            [
                'cat_id' => 9,
                'name' => 'ચુલા',
            ],
            [
                'cat_id' => 9,
                'name' => 'બાકડા',
            ],
            [
                'cat_id' => 9,
                'name' => '૭ = ફુટ બેલાખા',
            ],
            [
                'cat_id' => 9,
                'name' => '૮ = ફુટ બેલાખા',
            ],
            [
                'cat_id' => 9,
                'name' => '૯ = ફુટ બેલાખા',
            ],
            [
                'cat_id' => 9,
                'name' => '૧૦ = ફુટ	બેલાખા',
            ],
            
            // Category 10 - પ્રેસ ના ફ્રેન્સીંગ
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૨ ફુટ - ખુટા',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = 3 ફુટ - ખુટા',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૪ ફુટ - ખુટા',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૫ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૬ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૭ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૮ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૬ = ૯ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૪ = ૬ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 10,
                'name' => '૪ * ૪ = ૭ ફુટ - પ્રેસ ના ફ્રેન્સીંગ',
            ],
            
            // Category 21 - સાદા ફ્રેન્સીંગ
            [
                'cat_id' => 11,
                'name' => '૪ * ૬ = ૬ ફુટ - ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 11,
                'name' => '૪ * ૬ = ૭ ફુટ - ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 11,
                'name' => '૪ * ૬ = ૮ ફુટ - ફ્રેન્સીંગ',
            ],
            [
                'cat_id' => 11,
                'name' => '૪ * ૪ = ૧ || ફુટ - ખુટા',
            ],
            [
                'cat_id' => 11,
                'name' => '૪ * ૪ = ૧ ||| ફુટ - ખુટા',
            ],
            [
                'cat_id' => 11,
                'name' => '૪ * ૪ = ૨ ફુટ - ખુટા',
            ],
            
            // Category 22 - બીમ
            [
                'cat_id' => 12,
                'name' => '૪ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૫ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૬ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૭ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૮ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૯ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૧0 ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૧૧ ફુટ બીમ',
            ],
            [
                'cat_id' => 12,
                'name' => '૧૨ ફુટ બીમ',
            ],
            
            // Category 23 - પથર ફુટ
            [
                'cat_id' => 13,
                'name' => 'પથર ફુટ',
            ],
            
            // Category 24 - બારી ફુટ
            [
                'cat_id' => 14,
                'name' => 'બારી ફુટ',
            ],
            
            // Category 25 - ડ્રેગન પોલ
            [
                'cat_id' => 15,
                'name' => 'ડ્રેગન પોલ',
            ],
            
            // Category 26 - કુંન્ડા
            [
                'cat_id' => 16,
                'name' => 'કુંડા',
            ],
            
            // Category 27 - ફેન્સીગ  પોલ
            [
                'cat_id' => 17,
                'name' => 'ફેન્સીગ  પોલ',
            ],
            
            // Category 28 - જીએબી ફેન્સીગ  પોલ
            [
                'cat_id' => 18,
                'name' => 'જીએબી ફેન્સીગ  પોલ',
            ],
            
            // Category 29 - કરબીન ડીવાઇડર
            [
                'cat_id' => 19,
                'name' => 'કરબીન ડીવાઇડર',
            ],
            
            // Category 30 - RCC
            [
                'cat_id' => 20,
                'name' => 'RCC બ્લોક',
            ],
            [
                'cat_id' => 20,
                'name' => 'RCC ઈટુ',
            ],
            
            // Category 31 - રોડ સ્ટોન ખૂતા
            [
                'cat_id' => 21,
                'name' => 'ગાસ સ્ટોન',
            ],
            [
                'cat_id' => 21,
                'name' => 'ઈડીકેટર ',
            ],
            [
                'cat_id' => 21,
                'name' => 'કિલો મીટર ',
            ],
        ];

        foreach ($subcategories as $subcategoryData) {
            Subcategories::create([
                'user_id' => User::first()->id,
                'cat_id' => $subcategoryData['cat_id'],
                'name' => $subcategoryData['name'],
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
} 